In [7]:
import pandas as pd

data = pd.DataFrame({
    "Name": ['Alice', 'Bob', 'Alice', 'David'],
    "Age": [25, 30, 25, 40],
    "City": ['NY', 'LA', 'SF', 'Chicago']
})

first_keep = data.drop_duplicates(subset=['Name'], keep='first')
print("Keep First (based on Name):\n")
first_keep

Keep First (based on Name):

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [8]:
last_keep = data.drop_duplicates(subset=['Age'], keep='last')
print("Keep Last (based on Age):\n")
last_keep

Keep Last (based on Age):

    Name  Age     City
1    Bob   30       LA
2  Alice   25       SF
3  David   40  Chicago

In [9]:
remove_all = data.drop_duplicates(subset=['Name', 'Age'], keep=False)
print("Remove All Duplicates (based on Name & Age):\n")
remove_all

Remove All Duplicates (based on Name & Age):

    Name  Age     City
1    Bob   30       LA
3  David   40  Chicago